// array.concat - використовується для обʼєднання двох або більше масивів і новий масив (немутуючий)
// array.fill()- використовується для заповнення всіх елементві масиву якимсь одним значенням (мутуючий)
// array.includes - використовується для перевірки наявності певного елементу у масиві (немутуючий)
// array.indexOf - використовуєтьcя для отримання першого входження певного значення у масиві (немутуючий)
// array.join - використовується для створення рядка обʼєднуючи всі елементи масиву(немутуючий)
// array.push - використовується для додавання одного або кількох елементів у кінець (мутуючий)
// array.pop - використовується для видалення останнього елементу (мутуючий)
// array.shift - використовується для видалення першого елементу  з початкку масиву (мутуючий)
// array.unshift - використовується для додавання одного  або декількох елементів на початок масиву (мутуючий)
// array.reverse - використовується для зміни порядку елементів у масиві на протилежний (мутуючий)

//array.slice - використовується для створення одного масиву, який складається тільки з якоїсь певної частини масиву
//array.slice([start = 0], [end = array.length-1]);
//[start, end]

//копіює масив з індекса М (включно) до індекса N (не включаючи)
// arr.slice(M, N);

const arr1 = [1, 2, 3, 4, 5, 6, 7, 8];
const arr2 = arr1.slice(2);

const users = [
  { name: "John", 
    lastName: "Doe",},
  { name: "Doe", 
    lastName: "John" },
  { name: "Jack", 
    lastName: "Dosh" },
];

const newUsers = users.slice();// поверхнева копія
const upUsers = newUsers.slice();// поверхнева копія з поверхневої копії
