// Типи даних

// обʼєкт
//7 примітивних типів даних: Number, String, Bigint, Boolean, null, undefined, Symbol

// Примітивні типи даних вони копіюються завжди за значенням і не мають властивостей та методів
// Обʼєкти можуть мати властивості та методи і вони завжди копіюються за посиланням

// String
// string. length - довжина рядка
// string. toUpperCase - приводить строку у верхній регістр (не мутуючий)
// string.toLowercase - приводить строку у нижній регістр
// string.charAt - використовується для повернення символу з рядка за вказаним індексом
// string.charCodeAt - використовується для повернення кодової точки Unicode символу з рядка за вказаним індексом
// string.concat - використовується для обʼєднання (конкатеніції) двох або більше рядків і повертає новий рядок
// string.includes - використовується для перевірки, чи міститься певний підрядок у заданому рядку
// string.indexOf - використовується для отримання першого входження підрядка в рядку
// string.repeat - використовується для повторення рядка задану кількість разів і повертає новий рядок, який складається з повторень вихідного рядка
// string.replace - використовується для заміни частии рядка іншим рядком або регулярним виразом
// string.slice - використовується для вибору частини рядка за допомогою вказаних індексів
// string.trim - використовується для видалення пробілів з початку і кінця рядка
// string.split - використовується для розбивки вихідного рядка на підрядки використовуючи роздільник (separator) як точку розриву і повертає масив, що складаєтьсч з цих підрядків

for (let i = 0; i < str.length; i++) {
  // приклад проходу циклом по рядку
  console.log(str[i]);
}

// Boolean
// boolean. toString - приведення булевого типу до строки (не мутуючий)
const bool = true;
console.log(bool.toString());

// null/undefined - вони не маютьобʼєктів обгорток

console.log(undefined.tes); // помилка

// Number
// number.iaInteger - використовується для перевірки, чи є передане значення цілим числом
// number.isNaN - икористовується для перевірки значення на NaN

// number.toFixed - використовується для отримання (!) рядкового представлення числа з потрібною кількістю знаків після десяткової коми
// 15.1, 15.2, 15.3, 15.4,  --> 15
// 15.5 15.6, 15.7, 15.8, 15.9 --> 16

// ПРиклади

// Дано номер теелфону. Додати частку '+38'

let number = '09974875717';

const arrayFromNumber = Array.from(number);
arrayFromNumber.unshift('+', '3', '8');

number = arrayFromNumber.join('');

// Приклад 2: Дано рядок, перевернути його

let word = 'table';

word = Array.from(word).reverse().join('');

