/*

Symbol - представляє собою унікальний індетифікатор.
Кожен створений символ має свій унікальний індетифікатор, який ніде і ніколи е буде повторюватись

Особливість символів - вони завжди унікальні
Кожен створений символ, матиме унікальний індетифікатор, який ніде і ніколи не буде повторюватись

Гарантія унікальності - єдине, для чого Symbol  і існує

*/

const mySymbol = Symbol(''); // без new!

// const symb2 = Symbol('My second symbol');// label for human

const obj = {
  //  У обʼєктах ключами можуть бути рядки або символи
  test: 1,
  [mySymbol]: 123,
};

console.log(obj[mySymbol]);