// () оператор виклику функцій

// Інтерфейс - місце взаємодії між користувачем та системою

// Hello world!-ми не модемо писати будь-що, це не буде виконано браузером
//  МИ при програмуванні помтійно маємо дотримуватись певних правил

// однорядковий коментар

/* багаторядковий коментар
строка 1
строка 2
строка 3
строка 4
строка 5
*/

// Кожний тип даних по своєму виділяється у консоль лог

console.log(false);  // boolean
console.log('This is text');// string
console.log(50);//number
console.log(null);
console.log(undefined);
console.log(BigInt);//bigint





