// Унарні, бінарні, тернарні

// Тернарний оператор - потребує 3-х операндів

// Тернарний оператор дозволяяє вибрати 1 з 2 операндів на основі заданої умови.

// let result =  умова ? операнд1 : операнд2;

// операнд1 - значення для змінноії result, якщо умова буде true
// операнд2 - значення для змінноії result, якщо умова буде false

const age = 9;

// задача: реалізувати обмеження, щоб особи які не досягли повноліття не могли купувати алкогольні та тютюнові вироби

const isAdult = age > 18 ? true: false;

console.log(isAdult);

/*

1. Створіть булеву змінну isAoth, в якій самостійно визначте, чи авторизований користувач
Тобто, привласніть цій змінній значення true або false.

2. Створіть змінну vieMode, яка у випадку авторизованого користувача має містити рядок 'authMode',
а у випаду не авторизованого користувача 'unauth'.(тернарний оператор)

*/

const isAust = true;

const vieMode = isAust === true ? 'authMode' : 'unauth';

console.log(vieMode);


/*

Задача 2 

у нас є число.
потрібно перевірити входження числа у діапазон (з використанням тернарного оператора!)
якщо число входить у діапазон від 6 до 12, то у змінній має міститись рядок in в протилежному випадку рядок out

*/

const number =13;

const result = number >= 6 && <= 12 ? 'in' : 'out';

console.log(result);

