// Унарні, бінарні, тернарні

// Тернарний оператор - потребує 3-х операндів

// Тернарний оператор дозволяяє вибрати 1 з 2 операндів на основі заданої умови.

// let result =  умова ? операнд1 : операнд2;

// операнд1 - значення для змінноії result, якщо умова буде true
// операнд2 - значення для змінноії result, якщо умова буде false

const age = 9;

// задача: реалізувати обмеження, щоб особи які не досягли повноліття не могли купувати алкогольні та тютюнові вироби

const isAdult = age > 18 ? true: false;

console.log(isAdult);