//Математичні оператори

// Бінарні оператори - коли потрібно два операнди

let a = 2 + 2; // 4
let b = 2 - 2; // 0
let c = 2 * 2;// 4
let d = 2 / 2;// 1

// Унарні оператори -  коли потрібнен тільки 1 операнд

let e = -2;


// % - Залишок від цилочисельного поділу


/*

Дано
Тістечок - 12
друзів - 3
РОзділити порівну - ?

Рішення:
12 / 3 = 4 (тістечка)

Кожному другу дістанеться по 4 тістечка. не буде зайвих
Залишок від чилочисельного поділу - 0

Задача 2.
Дано
Тістечок - 15
друзів - 6
РОзділити порівну - ?

Рішення
15 / 6 = 2.5
ціле - 2
кожний друг, отримає по 2 тістечка( 6 * 2 = 12)
15 - 12 = 3  (тістечка) - залишок

Число 2 - результат цілочисельного поділу (скільки тістечок отримає кожний друг без залишку)
Чило 3 - залишок від чилочисельного поділу

*/

//Залишок від цілочисельного поділу - число, яке залишається після того, як одне ціле число ділиться на інше ціле число без залишку

//вірішення задачі 2 з використання спеціального оператора
let rest = 15 % 6;
console.log(rest);// 3

// задача - визначити парність непарність числа
// чи є число 4 парним числом

let pair = 4 % 2; //0
console.log(pair);
//  в залишку 0 при діленні на 2

let unPair = 5 % 2;//1
console.log(unPair);
// в залишку не 0 при діленні на 2 - число не парне

// ** - оператор ступеня
// задача- піднести 2 у 3 степінь (2 ^ 9)
//const x3 =   2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2; - 1 спосіб
const x3 = 2 ** 9;
console.log(x3);