/* 
Синтаксис if-else:

if(логічна операція, результатом якої буде тип Boolean) {
... блок коду, який буде виконуватись, якщо умова = true (істина)}
else{блок коду, який буде виконуватись, якщо умова = false (хиба)
}
if-else if-else

Синтаксис.

if(умова 1) {
блок коду, який виконається , якщо умова 1 = true}
else if (умова 2) {блок коду, який виконається ,
 якщо умова 2 = false
} esle {лок коду, який виконається ,
 якщо умова 1 і умова 2 = false
 }

*/

/* 

Дано число r.
Якщо r > 12 - вивести в консоль більше 12
в іншому випадку, якщо r < 5 - вивести в консоль менше 5
в іншому випадку - вивести в діапоазоні між 5 і 12

*/

let r = 6;

if(r>12) {
    console.log('більше 12');
} else if (r<5) {
    console.log('менше 5');
} else {
    console.log('в діапазоні між 5 і 12');
}