// array.concat - використовується для обʼєднання двох або більше масивів і новий масив (немутуючий)
// array.fill()- використовується для заповнення всіх елементві масиву якимсь одним значенням (мутуючий)
// array.includes - використовується для перевірки наявності певного елементу у масиві (немутуючий)
// array.indexOf - використовуєтьcя для отримання першого входження певного значення у масиві (немутуючий)
// array.join - використовується для створення рядка обʼєднуючи всі елементи масиву(немутуючий)
// array.push - використовується для додавання одного або кількох елементів у кінець (мутуючий)
// array.pop - використовується для видалення останнього елементу (мутуючий)

// array.shift - використовується для видалення першого елементу  з початкку масиву (мутуючий)

//const arr1 = [5, 12, 11, 24, 85];
//console.log(arr1.shift());

// array.unshift - використовується для додавання одного  або декількох елементів на початок масиву (мутуючий)
// array.unshift(element1, element2, ..... elementN)

//const arr2 = [1, 2, 3, 4];
//arr2.unshift(-1, 0);

// array.reverse - використовується для зміни порядку елементів у масиві на протилежний (мутуючий)

//const arr3 = [1, 2, 3, 4, 5];
//console.log(arr3.reverse);

//методи, які змінюють вихідний масив - мутуючі методи
//методи, які НЕ змінюють вихідний масив - немутуючі методи(більшість методів масиву)

/*

1. Дано два масива: [1, 2, 3,] [4, 5, 6] Обʼєднати у один масив
2. Дано масив [1, 2, 3]. зробити з нього масив [3, 2, 1]
3. Даний масив [3, 4, 5]. Додайте йому в кінець елементи 4. 8. 10
4. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть в консоль останній елемент та видаліть його з масива
5. Даний масив ['3', 7, 10]. Додайте йому на початок елементи 2,8
6. Даний масив ['3', 7, 10]. Отримайте з нього рядок

*/

//1.
const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];
const arr3 = arr1.concat(arr2);

//2.
const arr4 = [1, 2, 3];
arr4.reverse();

//3.
const arr5 = [3, 4, 5];
arr5.push(4, 8, 10);

//4.
const arr6 = ["aaa", "bbb", "ccc"];
console.log(arr6.pop());

//5.
const arr7 = ["3", 7, 10];
arr7.unshift(2, 8);

//6.
const result = arr7.join();
console.log(result);