// Мутація - зміна
// Мутабельне - те, що можна змінити
// Іммутабельне - те, що не може бути змінено

const user = {// обʼєкти мутабельні
    name: 'John',
    lastName: 'Doe'
}

user.isHungry = false;

// примітивні типи (String, Number, Boolean, Null, Undefined, Symbol, Bigint) - іммутабельні

const userName = 'John Doe';
userName.isHungry = false;

// array.concat - використовується для обʼєднання двох або більше масивів і новий масив (немутуючий)
// array.fill()- використовується для заповнення всіх елементві масиву якимсь одним значенням (мутуючий)
// array.includes - використовується для перевірки наявності певного елементу у масиві (немутуючий)
// array.indexOf - використовуєтьcя для отримання першого входження певного значення у масиві (немутуючий)
// array.join - використовується для створення рядка обʼєднуючи всі елементи масиву(немутуючий)
// array.push - використовується для додавання одного або кількох елементів у кінець (мутуючий)
// array.pop - використовується для видалення останнього елементу (мутуючий)
// array.shift - використовується для видалення першого елементу  з початкку масиву (мутуючий)
// array.unshift - використовується для додавання одного  або декількох елементів на початок масиву (мутуючий)
// array.reverse - використовується для зміни порядку елементів у масиві на протилежний (мутуючий)
// array.slice - використовується для створення одного масиву, який складається тільки з якоїсь певної частини масиву

// array.splice - використовується для зміни вмісту масиву шляхом видалення, заміни або додавання нових елементів( мутуючий)
// array.splice (start, deleteCount, .... items)
// start - початковий індекс, з якого ми починаємо змінювати масив
// deleteCount - скільки елементів потрібно видалити з масиву
// якщо це не вказати будуть видален всі елементи від start lj rsywz vfcbde
// ...items - нові елементи, які будуть вставлені на місце видалених елементів


const arr = [1, 2, 3, 4, 5];

//задача : починаючи з другого індексу видали один елемент

console.log(arr.splice(2, 2));// [1, 2, 5]

// splice(M, L)
// M - з якого індексу починати
// L - скільки елементів видалити

// Задача% додати після 2 додати рядоки 'hello','John', 'Doe' при цьому нічого не видаляти

arr.splice(2, 0, 'hello', 'John', 'Doe');

// Задача: починаючи з 2 індексу видалити 3 елементи і вставити числа 3, 4.  

arr.splice(2, 3, 3, 4 );

const array2 = [1, 2, 3];
array2.splice(5, 0, 'hello')

 