// Задача: зберегти розклад занять, використовуючи дні тижня як ключі, а знченнями будуть списки щанять, які відбуваються у відповідний день

const schedule = new Map();
 
// Додавання занять для розкладу
schedule.set('Понеділок', ['Математика', 'Фізика']);
schedule.set('Вівторок', ['Англійська мова', 'Всесвітня історія']);
schedule.set('Середа', ['Хімія', 'Географія']);
schedule.set('Четвер', ['Зарубіжна література', 'Біологія']);
schedule.set('П\ʼятниця', ['Інформатика', 'Фізкультура']);


// Отримання розкладу занять для певного дня
console.log( schedule.get('Понеділок'));

// Перевірка, чи є розклад для певного дня
console.log(schedule.has('Субота'));

// Отримання кількості днів занять в розкладі
console.log(schedule.size);

