/*

ми маємо змінну яку вказує на кількість хвилин в годині
визначити, в якій чверті годинника знаходитьсґ ця кількість хвилин
якщо кількість хвилин попадає в першу чверть години - вивести на консоль "перша чверть"
якщо кількість хвилин попадає в другу чверть години - вивести на консоль "друга чверть"
якщо кількість хвилин попадає в третю чверть години - вивести на консоль "третя чверть"
якщо кількість хвилин попадає в четверту чверть години - вивести на консоль "четверта чверть"

*/

/*const minutes = 45;

if (min >= 0 && minutes <= 15) {
  console.log("перша чверть");
} else if (minutes > 15 && minutes <= 30) {
  console.log("друга чверть");
} else if (minutes > 30 && minutes <= 45) {
  console.log("третя чверть");
} else if (minutes > 45 && minutes <= 60) {
  console.log("четверта чверть");
} else {
  console.log("виникла помилка");
}
*/

/*

Задача 2 

ви зберігаєте у змінній рік.
потрібно визначити, чи є цей рік високосним.
Примітка. Рік є високосним, якщо його номер кратний 4 і не кратний 100, або якщо він кратнйи 400.
*/

/*
const year = 1990;
if( year % 4 === 0 && year % 100 !== 0 || year % 100 === 0){
  console.log(year + ' є високосним');
} else {
  console.log(year + ' не є високосним');
}
  */

/* 
Задача 3
 у вас є задане початкове і кінцеве значення діапазону, і також певне число.
 визначити чи входить це число в заданний діапазон чи ні 
 якщо число знаходиться між початковим і кінцевим значенням діапазону (включно), вивести
 "в діапазоні"
 в іншому випадку вивести "поза діапазоном"
 */

/*
 const left = 10;// початкове значення діапазону
const right = 20;// кінцеве значення діапазону

const number = 15;


// 15(number) є[10; 20]
//перевірка входження числа в діапазон

if (number >= left && number <= right) {
  console.log(number + 'є' + '[' +left + ';' + right + '];');
} else{
  console.log('поза діапазоном');
}
  */

/*
 Задача 4 
 козак Вус проводить змаганння з програмування, в якому беруть участь n людей.
 Він вирішив нагородити їх усій ручками та блокнотами.
 Відомо, що Ус має рівно m ручок і k блокнотів.
 Визначте, чи може козак Вус нагородити всіх учасників, даючи кожному з
  них щонайменше по одній ручці і одному блокнотові
 */

/*
const n = 20; //кількість учасників
const m = 19; //кількість ручок
const k = 50; //кількість блокнотів

if (m >= n && k >= n) {
  console.log("Так, зможе нагородити");
} else {
  console.log("Ні, не зможе нагородити");
}
  */

/* Задача 5 
Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки на основі віку відвідувачів
Вхідні квитки мають різні ціни в залежності від віку відвідувачівю
ВАм потрібно реалізувати логіку, яка в залежності від віку відвідувача повертає вартість його квитка згідно його віку

- Діти до 6 років - безкотовний вхід
- Діти від 6 до 12 років ( включно)- КВИТОК КОШТУЄ $10
- Дорослі від 12 і старше  - КВИТОК КОШТУЄ $20

Якщо дорослий надає документ, що підтверджує його право на пільги, то дорослому надається зннижка 50%

*/

const age = 5;// Вік відвідувача
const hasDiscount = false;// Наявність знижки у дорослого

let ticetPrice;

if(age < 0  || typeof age !== 'number'){// якщо вік > 0 або вік не є числом
  console.log(' Ви ввели не коректний вік користуачаю Спробуйте ще раз');
} else if (age <= 6) {
  ticetPrice = 0;
}else if (age <= 12) {
  ticetPrice = 10;
} else if (hasDiscount === false) {
  ticetPrice = 20;
}else {
  ticetPrice = 10;
}

if(ticetPrice !== undefined) {
  console.log('Вартість квитка складає ' + ticetPrice + '$');
}
