// Функції
// функція (підпрограмма) -блок коду який виконує певні дії при виклику.
//функція може приймать аргументи - значення , якв передаються у функцію. функція може викори товувати аргументи
// функія може викликати аргументи( або ні)
// функція - фрагмент програмного коду, до якого можна звернутись з іншого місця програми

/* Синтаксис функції

Як оголосити функцію

function імʼя_функції(аргумент1, аргумент2) {
....... тіло функції}

*/

// Задача- написати ффункцію, яка буде приймати імʼя користувача- строка і буде вітатись з цим користуачем

function greetingUser(userName) {
  console.log("Hi," + userName);
}
// використання функції
greetingUser("Alex"); // Alex - аргумент
greetingUser("John");
greetingUser("Sam");
greetingUser("Solar");
