/*

For

for(початковий стан; умова, за якої цикл повторюється; зміна лічильника на кожній ітерації;){
блок коду, який повторюється
}

початковий стан - початкове значення для лічильника

*/

//задача. вивести 10 консоль логів

for (let i = 0; i < 10; i = i + 3) {
  console.log(i);
}

/*
Задача . написати функцію, яка описує факторіал переданого ій числа, результат роботи вивести на консоль

факторіал - 
5! = 1*2*3*4*5
10! = 1*2*3*4*5*6*7*8*9*10
якщо, число відємне-поверніть з функції помилку
якщо число дорівнює 0 або 1 поверніть з функції 1
знаходимо факторіал ...
*/

function factorial(number) {
  let res = 1;//у цій змінній ми будемо накопичувати добуток
  
  if (number === 0 || number === 1) {
    return 1;
  } else if (number < 0) {
    return null;
  } 
  for (let it = 1; it <= number; it++) {
      res = res * it;
  }
  return res;
}
console.log(factorial(10));
