/*
1. з масиву [1, 2, 3, 4, 5] зробіть масив [1, 4, 5]
2. з масиву [1, 2, 3, 4]  запишіть mасив [2, 3, 4] 
3. з масиву [1, 2, 3, 4, 5] зробіть масив [1, 'w', 'tr-td', 2, 3, 4, 'vv', 5, 'aa']

*/

//1
const array1 = [1, 2, 3, 4, 5];
array1.splice(2, 3);

//2
const array2 = [1, 2, 3, 4];
const array3 = array2.slice(1);

//3
const array4 = [1, 2, 3, 4, 5];
array4.splice(1, 0, "w", "tr-td");
array4.splice(6, 0, "vv");
array4.push("aa");

/*
Напишіть функцію, яка приймає масив і перевіряє, чи є в масиві два елемента поспіль.
Масив повертає true, якщо є два однакових елементи поспіль
Функція повертає false, якщо двох однакових елементів поспіль у масиві немає

[1, 2, 3, 4, 5]// true
[1, 2, 2, 3, 4]// false

Суть вирішення:
потрібно  переглянуть масив циклом
на кожній ітерації циклу порівнювати поточне число з наступним числом у масиві
якщо, число поточне і число наступне співпали - повертаємо true з функції
якщо, число поточне і число наступне не співпали - нічого не робимоʼ

array[i] - поточне число
array[i + 1] - наступне число
*/

function isDoubleElement(array) {
  for (let i = 0; i < array.length -1; i++) {
    if (array[i] === array[i + 1]) {
      return true;
    }
  }
  return false;
}
